ehcache-vs-redis-in-hibernate/artillery-load-testing/script.yml
config:
  target: "http://localhost:8080"
  processor: "./processor.js"
  phases:
  - duration: 10
    arrivalRate: 600
#    rampTo: 50
    name: "Warm up the application"
#  - duration: 600
#    arrivalRate: 500
#    name: "Sustained max load"
scenarios:
- name: "POST create an order"
  flow:
  - post:
      headers:
        content-type: "application/json"
      url: "/orders"
      beforeRequest: "assignNewId"
      body: |
        {
          "orderId": "@@id@@",
          "itemId": "1",
          "customerId": "1"
        }
- name: "GET orders"
  flow:
  - get:
      url: "/orders"
- name: "GET orders by customer id"
  flow:
  - get:
      url: "/orders/1"